{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 4, 4], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 16, 112, 112, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 11, 11]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, "trainable": false, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, "trainable": false, "name": "time_distributed_3"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, "trainable": false, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, "trainable": false, "name": "time_distributed_6"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_7"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, "trainable": false, "name": "time_distributed_8"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, "trainable": false, "name": "time_distributed_9"}}]}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 14, 14, 64], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_10"}, "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": false, "name": "time_distributed_11"}, "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}}, "trainable": false, "name": "time_distributed_12"}, "name": "time_distributed_12"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "trainable": false, "name": "time_distributed_13"}, "name": "time_distributed_13"}, {"class_name": "GRU", "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 196, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null, "recurrent_regularizer": null, "name": "gru_1", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "gru_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["gru_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_14"}, "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 196, "use_bias": true, "activity_regularizer": null}}, "trainable": false, "name": "time_distributed_15"}, "name": "time_distributed_15"}, {"class_name": "Reshape", "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "config": {"target_shape": [16, 14, 14, 1], "trainable": false, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "AttnLossLayer", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"trainable": false, "name": "attn_loss_layer_1"}, "name": "attn_loss_layer_1"}, {"class_name": "Multiply", "inbound_nodes": [[["time_distributed_12", 0, 0, {}], ["attn_loss_layer_1", 0, 0, {}]]], "config": {"trainable": false, "name": "multiply_1"}, "name": "multiply_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_16"}, "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": false, "name": "time_distributed_17"}, "name": "time_distributed_17"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": false, "data_format": "channels_last", "name": "up_sampling3d_1"}, "name": "up_sampling3d_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "filters": 128, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_3", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_18"}, "name": "time_distributed_18"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": false, "name": "time_distributed_19"}, "name": "time_distributed_19"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": false, "data_format": "channels_last", "name": "up_sampling3d_2"}, "name": "up_sampling3d_2"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "filters": 32, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_4", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": false, "name": "time_distributed_20"}, "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, "trainable": false, "name": "time_distributed_21"}, "name": "time_distributed_21"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": false, "data_format": "channels_last", "name": "up_sampling3d_3"}, "name": "up_sampling3d_3"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": false, "filters": 3, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_5", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_5"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_5", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, "trainable": false, "name": "time_distributed_22"}, "name": "time_distributed_22"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["time_distributed_22", 0, 0]]}}], "backend": "tensorflow"}