{"class_name": "Sequential", "keras_version": "2.1.4", "config": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 128, 208, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv3D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 4, 4], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 7, 7]}, "name": "conv3d_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_1"}, "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, "trainable": true, "name": "time_distributed_2"}, "name": "time_distributed_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}}, "trainable": true, "name": "time_distributed_3"}, "name": "time_distributed_3"}, {"class_name": "Conv3D", "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}, "name": "conv3d_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_2", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_4"}, "name": "time_distributed_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, "trainable": true, "name": "time_distributed_5"}, "name": "time_distributed_5"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}}, "trainable": true, "name": "time_distributed_6"}, "name": "time_distributed_6"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_3", 0, 0, {}], ["time_distributed_6", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv3D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}, "name": "conv3d_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_3", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_7"}, "name": "time_distributed_7"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, "trainable": true, "name": "time_distributed_8"}, "name": "time_distributed_8"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}}, "trainable": true, "name": "time_distributed_9"}, "name": "time_distributed_9"}, {"class_name": "Conv3D", "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_4", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_10"}, "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": true, "name": "time_distributed_11"}, "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}}, "trainable": true, "name": "time_distributed_12"}, "name": "time_distributed_12"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_9", 0, 0, {}], ["time_distributed_12", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv3D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_5"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_5", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_13"}, "name": "time_distributed_13"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": true, "name": "time_distributed_14"}, "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_5"}}, "trainable": true, "name": "time_distributed_15"}, "name": "time_distributed_15"}, {"class_name": "Conv3D", "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "name": "conv3d_6"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_6", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_16"}, "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": true, "name": "time_distributed_17"}, "name": "time_distributed_17"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_6"}}, "trainable": true, "name": "time_distributed_18"}, "name": "time_distributed_18"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_15", 0, 0, {}], ["time_distributed_18", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_3", 0, 0]]}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 26, 128], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 128, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_19"}, "name": "time_distributed_19"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_4"}}, "trainable": true, "name": "time_distributed_20"}, "name": "time_distributed_20"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 128, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_21"}, "name": "time_distributed_21"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, "trainable": true, "name": "time_distributed_22"}, "name": "time_distributed_22"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_20", 0, 0, {}], ["time_distributed_22", 0, 0, {}]]], "config": {"trainable": true, "name": "add_4"}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1"}, "name": "up_sampling3d_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_3", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_23"}, "name": "time_distributed_23"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_7"}}, "trainable": true, "name": "time_distributed_24"}, "name": "time_distributed_24"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_4", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_25"}, "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_8"}}, "trainable": true, "name": "time_distributed_26"}, "name": "time_distributed_26"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_24", 0, 0, {}], ["time_distributed_26", 0, 0, {}]]], "config": {"trainable": true, "name": "add_5"}, "name": "add_5"}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2"}, "name": "up_sampling3d_2"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 16, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_5", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_5"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_5", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_27"}, "name": "time_distributed_27"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_27", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_10"}}, "trainable": true, "name": "time_distributed_28"}, "name": "time_distributed_28"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 16, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_6", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_6"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_6", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_29"}, "name": "time_distributed_29"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_11"}}, "trainable": true, "name": "time_distributed_30"}, "name": "time_distributed_30"}, {"class_name": "Add", "inbound_nodes": [[["time_distributed_28", 0, 0, {}], ["time_distributed_30", 0, 0, {}]]], "config": {"trainable": true, "name": "add_6"}, "name": "add_6"}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3"}, "name": "up_sampling3d_3"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 3, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_7", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "conv_lst_m2d_7"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv_lst_m2d_7", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_13"}}, "trainable": true, "name": "time_distributed_31"}, "name": "time_distributed_31"}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["time_distributed_31", 0, 0]]}}], "backend": "tensorflow"}