{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 128, 128, 3], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 32, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [2, 2], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_6", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0010000000474974513}}, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv_lst_m2d_6"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_8"}}, "trainable": true, "name": "time_distributed_23"}, "inbound_nodes": [[["conv_lst_m2d_6", 0, 0, {}]]], "name": "time_distributed_23"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}}, "trainable": true, "name": "time_distributed_24"}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "name": "time_distributed_24"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [2, 2], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_7", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0010000000474974513}}, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "name": "conv_lst_m2d_7"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_25"}, "inbound_nodes": [[["conv_lst_m2d_7", 0, 0, {}]]], "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}}, "trainable": true, "name": "time_distributed_26"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "name": "time_distributed_26"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}}, "trainable": true, "name": "time_distributed_27"}, "inbound_nodes": [[["time_distributed_26", 0, 0, {}]]], "name": "time_distributed_27"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 128, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [2, 2], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_8", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0010000000474974513}}, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_27", 0, 0, {}]]], "name": "conv_lst_m2d_8"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_28"}, "inbound_nodes": [[["conv_lst_m2d_8", 0, 0, {}]]], "name": "time_distributed_28"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_10"}}, "trainable": true, "name": "time_distributed_29"}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "name": "time_distributed_29"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_7"}}, "trainable": true, "name": "time_distributed_30"}, "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "name": "time_distributed_30"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 256, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [2, 2], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_9", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0010000000474974513}}, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_30", 0, 0, {}]]], "name": "conv_lst_m2d_9"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_31"}, "inbound_nodes": [[["conv_lst_m2d_9", 0, 0, {}]]], "name": "time_distributed_31"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_11"}}, "trainable": true, "name": "time_distributed_32"}, "inbound_nodes": [[["time_distributed_31", 0, 0, {}]]], "name": "time_distributed_32"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_8"}}, "trainable": true, "name": "time_distributed_33"}, "inbound_nodes": [[["time_distributed_32", 0, 0, {}]]], "name": "time_distributed_33"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, "trainable": true, "name": "time_distributed_34"}, "inbound_nodes": [[["time_distributed_33", 0, 0, {}]]], "name": "time_distributed_34"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_35"}, "inbound_nodes": [[["time_distributed_34", 0, 0, {}]]], "name": "time_distributed_35"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_36"}, "inbound_nodes": [[["time_distributed_35", 0, 0, {}]]], "name": "time_distributed_36"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["time_distributed_36", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}