{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 26, 128], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 128, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv_lst_m2d_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_19"}, "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_4"}}, "trainable": true, "name": "time_distributed_20"}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 128, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "conv_lst_m2d_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_21"}, "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "name": "time_distributed_21"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, "trainable": true, "name": "time_distributed_22"}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "time_distributed_22"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}], ["time_distributed_22", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1", "size": [1, 2, 2]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "up_sampling3d_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_3", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "name": "conv_lst_m2d_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_23"}, "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]], "name": "time_distributed_23"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_7"}}, "trainable": true, "name": "time_distributed_24"}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "name": "time_distributed_24"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_4", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "name": "conv_lst_m2d_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_25"}, "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}]]], "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_8"}}, "trainable": true, "name": "time_distributed_26"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "name": "time_distributed_26"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}], ["time_distributed_26", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2", "size": [1, 2, 2]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "up_sampling3d_2"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 16, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_5", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "name": "conv_lst_m2d_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_27"}, "inbound_nodes": [[["conv_lst_m2d_5", 0, 0, {}]]], "name": "time_distributed_27"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_10"}}, "trainable": true, "name": "time_distributed_28"}, "inbound_nodes": [[["time_distributed_27", 0, 0, {}]]], "name": "time_distributed_28"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 16, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_6", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "name": "conv_lst_m2d_6"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_29"}, "inbound_nodes": [[["conv_lst_m2d_6", 0, 0, {}]]], "name": "time_distributed_29"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_11"}}, "trainable": true, "name": "time_distributed_30"}, "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "name": "time_distributed_30"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}], ["time_distributed_30", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3", "size": [1, 2, 2]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "up_sampling3d_3"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 3, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_7", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "name": "conv_lst_m2d_7"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_13"}}, "trainable": true, "name": "time_distributed_31"}, "inbound_nodes": [[["conv_lst_m2d_7", 0, 0, {}]]], "name": "time_distributed_31"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["time_distributed_31", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}