{"class_name": "Model", "keras_version": "2.1.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16, 16, 16, 64], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv_lst_m2d_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_10"}, "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": true, "name": "time_distributed_11"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}}, "trainable": true, "name": "time_distributed_12"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "time_distributed_12"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "trainable": true, "name": "time_distributed_13"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "time_distributed_13"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "gru_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_14"}, "inbound_nodes": [[["gru_1", 0, 0, {}]]], "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_15"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "time_distributed_15"}, {"class_name": "Reshape", "config": {"target_shape": [16, 16, 16, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "AttnLossLayer", "config": {"trainable": true, "name": "attn_loss_layer_1"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "attn_loss_layer_1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "multiply_1"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}], ["attn_loss_layer_1", 0, 0, {}]]], "name": "multiply_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "conv_lst_m2d_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_16"}, "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": true, "name": "time_distributed_17"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "time_distributed_17"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "up_sampling3d_1"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2", "size": [1, 2, 2]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "up_sampling3d_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}], ["up_sampling3d_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 128, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_3", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv_lst_m2d_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_18"}, "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]], "name": "time_distributed_18"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": true, "name": "time_distributed_19"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "up_sampling3d_3"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_4", "size": [1, 2, 2]}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "name": "up_sampling3d_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}], ["up_sampling3d_4", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 32, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_4", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv_lst_m2d_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_20"}, "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, "trainable": true, "name": "time_distributed_21"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "time_distributed_21"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_5", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "up_sampling3d_5"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 3, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_5", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_5", 0, 0, {}]]], "name": "conv_lst_m2d_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, "trainable": true, "name": "time_distributed_22"}, "inbound_nodes": [[["conv_lst_m2d_5", 0, 0, {}]]], "name": "time_distributed_22"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed_22", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}