{"class_name": "Model", "keras_version": "2.1.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16, 128, 128, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [4, 4], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [7, 7]}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_2"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, "trainable": true, "name": "time_distributed_3"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "name": "time_distributed_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, "trainable": true, "name": "time_distributed_5"}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "name": "time_distributed_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_6"}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "time_distributed_6"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, "trainable": true, "name": "time_distributed_7"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "time_distributed_7"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}}, "trainable": true, "name": "time_distributed_8"}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "time_distributed_8"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_9"}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "time_distributed_9"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_10"}, "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]], "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, "trainable": true, "name": "time_distributed_11"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}}, "trainable": true, "name": "time_distributed_12"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "time_distributed_12"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_13"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "time_distributed_13"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_14"}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": true, "name": "time_distributed_15"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "time_distributed_15"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}}, "trainable": true, "name": "time_distributed_16"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "time_distributed_16"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}], ["time_distributed_16", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "trainable": true, "name": "time_distributed_17"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "time_distributed_17"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "lstm_1"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "lstm_2"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeat_vector_1", "n": 16}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "name": "repeat_vector_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, "trainable": true, "name": "time_distributed_18"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "time_distributed_18"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}], ["time_distributed_18", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8192, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_19"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_5"}}, "trainable": true, "name": "time_distributed_20"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Reshape", "config": {"target_shape": [8, 8, 128], "trainable": true, "name": "reshape_1"}}, "trainable": true, "name": "time_distributed_21"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "time_distributed_21"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed_21", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}