{"class_name": "Model", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 128, 128, 3], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Sequential", "config": [{"class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 4, 4], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 10, 128, 128, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 11, 11]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, "trainable": true, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, "trainable": true, "name": "time_distributed_3"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, "trainable": true, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, "trainable": true, "name": "time_distributed_6"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_7"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, "trainable": true, "name": "time_distributed_8"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, "trainable": true, "name": "time_distributed_9"}}]}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 16, 16, 64], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv_lst_m2d_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_10"}, "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": true, "name": "time_distributed_11"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}}, "trainable": true, "name": "time_distributed_12"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "time_distributed_12"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "trainable": true, "name": "time_distributed_13"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "time_distributed_13"}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "gru_1", "bias_constraint": null, "go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "gru_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_14"}, "inbound_nodes": [[["gru_1", 0, 0, {}]]], "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_15"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "time_distributed_15"}, {"class_name": "Reshape", "config": {"target_shape": [10, 16, 16, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "multiply_1"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "name": "multiply_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 64, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "conv_lst_m2d_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_16"}, "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": true, "name": "time_distributed_17"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "time_distributed_17"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "up_sampling3d_1"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 128, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_3", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "name": "conv_lst_m2d_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_18"}, "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]], "name": "time_distributed_18"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": true, "name": "time_distributed_19"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "up_sampling3d_2"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 32, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_4", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "name": "conv_lst_m2d_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": true, "name": "time_distributed_20"}, "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, "trainable": true, "name": "time_distributed_21"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "time_distributed_21"}, {"class_name": "UpSampling3D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling3d_3", "size": [1, 2, 2]}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "up_sampling3d_3"}, {"class_name": "ConvLSTM2D", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "filters": 3, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "conv_lst_m2d_5", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]], "name": "conv_lst_m2d_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, "trainable": true, "name": "time_distributed_22"}, "inbound_nodes": [[["conv_lst_m2d_5", 0, 0, {}]]], "name": "time_distributed_22"}], "output_layers": [["time_distributed_22", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}], "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "sequential_2"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 10, 128, 128, 3], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_23"}, "name": "time_distributed_23"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_24"}, "name": "time_distributed_24"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_8"}}, "trainable": true, "name": "time_distributed_25"}, "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}}, "trainable": true, "name": "time_distributed_26"}, "name": "time_distributed_26"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_26", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_27"}, "name": "time_distributed_27"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_27", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_28"}, "name": "time_distributed_28"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}}, "trainable": true, "name": "time_distributed_29"}, "name": "time_distributed_29"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}}, "trainable": true, "name": "time_distributed_30"}, "name": "time_distributed_30"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_30", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_31"}, "name": "time_distributed_31"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_31", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_32"}, "name": "time_distributed_32"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_32", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_10"}}, "trainable": true, "name": "time_distributed_33"}, "name": "time_distributed_33"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_33", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_7"}}, "trainable": true, "name": "time_distributed_34"}, "name": "time_distributed_34"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_34", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_35"}, "name": "time_distributed_35"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_35", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_36"}, "name": "time_distributed_36"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_36", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_11"}}, "trainable": true, "name": "time_distributed_37"}, "name": "time_distributed_37"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_37", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_8"}}, "trainable": true, "name": "time_distributed_38"}, "name": "time_distributed_38"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_38", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_39"}, "name": "time_distributed_39"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_39", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_40"}, "name": "time_distributed_40"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_40", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_12"}}, "trainable": true, "name": "time_distributed_41"}, "name": "time_distributed_41"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_41", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_9"}}, "trainable": true, "name": "time_distributed_42"}, "name": "time_distributed_42"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_42", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, "trainable": true, "name": "time_distributed_43"}, "name": "time_distributed_43"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_43", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_44"}, "name": "time_distributed_44"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_44", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_13"}}, "trainable": true, "name": "time_distributed_45"}, "name": "time_distributed_45"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_45", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_10"}}, "trainable": true, "name": "time_distributed_46"}, "name": "time_distributed_46"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_46", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, "trainable": true, "name": "time_distributed_47"}, "name": "time_distributed_47"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_47", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_48"}, "name": "time_distributed_48"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_48", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_14"}}, "trainable": true, "name": "time_distributed_49"}, "name": "time_distributed_49"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_49", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_11"}}, "trainable": true, "name": "time_distributed_50"}, "name": "time_distributed_50"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_50", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_transpose_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "kernel_regularizer": null, "filters": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}}, "trainable": true, "name": "time_distributed_51"}, "name": "time_distributed_51"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_51", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_15"}}, "trainable": true, "name": "time_distributed_52"}, "name": "time_distributed_52"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_52", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_12"}}, "trainable": true, "name": "time_distributed_53"}, "name": "time_distributed_53"}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["time_distributed_53", 0, 0]]}, "inbound_nodes": [[["sequential_2", 1, 0, {}]]], "name": "model_2"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 10, 256, 256, 3], "name": "input_4", "sparse": false}, "name": "input_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_54"}, "name": "time_distributed_54"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_54", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_16"}}, "trainable": true, "name": "time_distributed_55"}, "name": "time_distributed_55"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_55", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_13"}}, "trainable": true, "name": "time_distributed_56"}, "name": "time_distributed_56"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_56", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_57"}, "name": "time_distributed_57"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_57", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_58"}, "name": "time_distributed_58"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_58", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_17"}}, "trainable": true, "name": "time_distributed_59"}, "name": "time_distributed_59"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_59", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_14"}}, "trainable": true, "name": "time_distributed_60"}, "name": "time_distributed_60"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_60", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_61"}, "name": "time_distributed_61"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_61", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_62"}, "name": "time_distributed_62"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_62", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_18"}}, "trainable": true, "name": "time_distributed_63"}, "name": "time_distributed_63"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_63", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_15"}}, "trainable": true, "name": "time_distributed_64"}, "name": "time_distributed_64"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_64", 0, 0, {}]]], "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}}, "trainable": true, "name": "time_distributed_65"}, "name": "time_distributed_65"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_65", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_66"}, "name": "time_distributed_66"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_66", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_19"}}, "trainable": true, "name": "time_distributed_67"}, "name": "time_distributed_67"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_67", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_16"}}, "trainable": true, "name": "time_distributed_68"}, "name": "time_distributed_68"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_68", 0, 0, {}]]], "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, "trainable": true, "name": "time_distributed_69"}, "name": "time_distributed_69"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_69", 0, 0, {}]]], "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_70"}, "name": "time_distributed_70"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_70", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_17"}}, "trainable": true, "name": "time_distributed_71"}, "name": "time_distributed_71"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_71", 0, 0, {}]]], "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_72"}, "name": "time_distributed_72"}], "input_layers": [["input_4", 0, 0]], "name": "model_3", "output_layers": [["time_distributed_72", 0, 0]]}, "inbound_nodes": [[["model_2", 1, 0, {}]]], "name": "model_3"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["model_2", 1, 0], ["model_3", 1, 0]], "name": "model_4"}, "backend": "tensorflow"}