{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 4, 4], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 10, 128, 128, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 11, 11]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, "trainable": true, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}}, "trainable": true, "name": "time_distributed_3"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, "trainable": true, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, "trainable": true, "name": "time_distributed_6"}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_7"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, "trainable": true, "name": "time_distributed_8"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, "trainable": true, "name": "time_distributed_9"}}]}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 10, 16, 16, 32], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv3DTranspose", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_transpose_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}, "name": "conv3d_transpose_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_transpose_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_10"}, "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": true, "name": "time_distributed_11"}, "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}}, "trainable": true, "name": "time_distributed_12"}, "name": "time_distributed_12"}, {"class_name": "Conv3DTranspose", "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_transpose_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2, 2], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 5, 5]}, "name": "conv3d_transpose_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["conv3d_transpose_2", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_13"}, "name": "time_distributed_13"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": true, "name": "time_distributed_14"}, "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}}, "trainable": true, "name": "time_distributed_15"}, "name": "time_distributed_15"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "convlstm_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [5, 5]}, "name": "convlstm_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["convlstm_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_16"}, "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": true, "name": "time_distributed_17"}, "name": "time_distributed_17"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_1"}, "name": "up_sampling3d_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 64, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "convlstm_w", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [5, 5]}, "name": "convlstm_w"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["convlstm_w", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_18"}, "name": "time_distributed_18"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, "trainable": true, "name": "time_distributed_19"}, "name": "time_distributed_19"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 1, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "aclstm_1", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [2, 2], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [3, 3]}, "name": "aclstm_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["aclstm_1", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_20"}, "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "config": {"layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "trainable": true, "name": "time_distributed_21"}, "name": "time_distributed_21"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_22"}, "name": "time_distributed_22"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]], "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}}, "trainable": true, "name": "time_distributed_23"}, "name": "time_distributed_23"}, {"class_name": "Reshape", "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "config": {"target_shape": [10, 64, 64, 1], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "CustomLossLayer", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"trainable": true, "name": "custom_loss_layer_1"}, "name": "custom_loss_layer_1"}, {"class_name": "Flatten", "inbound_nodes": [[["custom_loss_layer_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"class_name": "RepeatVector", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "name": "repeat_vector_1", "n": 64}, "name": "repeat_vector_1"}, {"class_name": "Permute", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "name": "permute_1"}, {"class_name": "Reshape", "inbound_nodes": [[["permute_1", 0, 0, {}]]], "config": {"target_shape": [10, 64, 64, 64], "trainable": true, "name": "reshape_2"}, "name": "reshape_2"}, {"class_name": "Multiply", "inbound_nodes": [[["time_distributed_19", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_1"}, "name": "multiply_1"}, {"class_name": "UpSampling3D", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": {"size": [1, 2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling3d_2"}, "name": "up_sampling3d_2"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]], "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "filters": 3, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "dropout": 0.0, "recurrent_dropout": 0.5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "padding": "same", "strides": [1, 1], "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "convlstm_2", "bias_constraint": null, "go_backwards": false, "data_format": "channels_last", "implementation": 0, "dilation_rate": [1, 1], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "kernel_size": [5, 5]}, "name": "convlstm_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["convlstm_2", 0, 0, {}]]], "config": {"layer": {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, "trainable": true, "name": "time_distributed_24"}, "name": "time_distributed_24"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "config": {"layer": {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, "trainable": true, "name": "time_distributed_25"}, "name": "time_distributed_25"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["time_distributed_25", 0, 0]]}}], "backend": "tensorflow"}