{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "filters": 64, "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 10, 128, 128, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4, 4]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, "trainable": false, "name": "time_distributed_13"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}}, "trainable": false, "name": "time_distributed_14"}}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [2, 4, 4], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4, 4]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": false, "name": "time_distributed_15"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, "trainable": false, "name": "time_distributed_16"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}}, "trainable": false, "name": "time_distributed_17"}}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4, 4]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}}, "trainable": false, "name": "time_distributed_18"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, "trainable": false, "name": "time_distributed_19"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_7"}}, "trainable": false, "name": "time_distributed_20"}}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [2, 2, 2], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4, 4, 4]}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, "trainable": false, "name": "time_distributed_21"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_8"}}, "trainable": false, "name": "time_distributed_22"}}, {"class_name": "Flatten", "config": {"trainable": false, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": false, "name": "activation_2"}}], "backend": "tensorflow"}